package org.example;

import java.util.List;

public class Task_2_1 {

    private String name;
    public String publicShit;
    String asdasd;
    protected List<Integer> wonderWaffle;

/*
 *модификатор*? *тип переменной* *название переменной*;
 *модификатор*? *тип переменной* *название переменной* = *значение*;

 */

    //2.1. Генерация случайного элемента с весом
// Задача:
//    Напишите класс, конструктор которого принимает два массива: массив значений и массив весов значений.
//    Класс должен содержать метод, который будет возвращать элемент из первого массива случайным образом, с учётом его
//    веса.
//    Пример: Дан массив [1, 2, 3], и массив весов [1, 2, 10]. В среднем, значение «1» должно возвращаться в 2 раза реже,
//    чем значение «2» и в десять раз реже, чем значение «3».
    public class Massiv {
        public Massiv(int[] kak, int[] vottak){

        }

    }
}
